app/controllers/ekimae_board_controller.rb

  def index
    @boards = Board.all
---
SELECT * FROM `boards` WHERE (created_at > '2010-02-25')