app/controllers/memos_controller.rb

SELECT * FROM `boards` WHERE (`boards`.`id` = 2)
SELECT * FROM `memos` WHERE (`memos`.`board_id` IS NULL)
---
  def index
    @select_board = Board.find(params[:board_id])
    session[:select_board] = @select_board
    @memos = Memo.find_all_by_board_id(params[:board_id])

SELECT * FROM `memos` WHERE (`memos`.`id` = 1)
---
  def show
    @select_board = session[:select_board]
    @memo = Memo.find(params[:id])

SELECT * FROM `memos` WHERE (`memos`.`id` = 10)
---
  def new_comment
     @select_board = session[:select_board]
    @memo = Memo.find(params[:id])

INSERT INTO `comments` (`message`, `author`, `memo_id`, `comment_id`) VALUES ('テスト', 'なか', 1, 1)
---
  def save_comment
    @select_board = session[:select_board]
    @comment = Comment.new(params[:comment])
    @comment.memo_id = params[:id]
    if @comment.save

INSERT INTO `memos` (`message`, `updated_at`, `title`, `author`, `tag`, `img_url`, `password`, `created_at`) VALUES('テストテスト', '2009-10-10 15:04:05', 'これはテストですよ', 'ああああ', '', '', 'test', '2009-10-10 15:04:05')
SELECT * FROM `memos`
---
  def save_memo
    @select_board = session[:select_board]
    @memo = Memo.new(params[:memo])
    @memo.board_id = @select_board.id
    @memo_logical = MemoLogical.new
    @memo = @memo_logical.save_memo(@memo,params[:rePassword])
    #if文で考えよう
    render :update do |page|
      if(@memo == nil)
        page.replace_html 'err_msg_id', '登録エラーです'
        @memos = Memo.all

SELECT * FROM `memos` WHERE (`memos`.`id` = 2)
---
  def edit_memo
    @select_board = session[:select_board]
    @memo = Memo.find(params[:id])

SELECT * FROM `memos` WHERE (`memos`.`id` = 4)
UPDATE `memos` SET `message` = 'aaaaaaaabb\n\nbbbb\n', `password` = 'test', `updated_at` = '2009-10-31 13:10:09', `author` = 'なか' WHERE `id` = 5
---
  def update_memo
    @select_board = session[:select_board]
    @memo = Memo.find(params[:id])
    @memo.board_id = @select_board.id
    if @memo.update_attributes(params[:memo])

SELECT * FROM `memos` WHERE (`memos`.`id` = 1)
DELETE FROM `memos` WHERE `id` = 1
---
  def remove_memo
    @select_board = session[:select_board]
    @memo = Memo.find(params[:id])
    @memo.destroy