app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT * FROM `places`