app/controllers/task_controller.rb

  def list
    user_id = session[:user_id].email
    if user_id ==nil || (user_id != nil && user_id.isBlank?)
      user_id = session[:user_id].nickname
    end
    @user_name= user_id
    @logical = TaskLogical.new
    @toDoTasks = @logical.findTodoAllTaskList(@user_name)
---
SELECT * FROM `tasks` WHERE (status='done' and user_id='ナカムー' and updated_at < '2010-06-13' and updated_at >= '2010-06-12') ORDER BY updated_at desc

  def task_list
    user_id = session[:user_id].email
    if user_id ==nil || (user_id != nil && user_id.isBlank?)
      user_id = session[:user_id].nickname
    end
    @user_name= user_id
    @page = Task.paginate(:page => params[:page], :per_page => 10)
---
SELECT * FROM `tasks` LIMIT 0, 10
SELECT count(*) AS count_all FROM `tasks`

  def edit
    @form_action = 'update'
    @form_button = 'タスク編集'
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)

  def destroy
    @logical = TaskLogical.new
    @task = @logical.destroyTask(params[:id])
---
DELETE FROM `tasks` WHERE `id` = 12

  def add_task
    user_id = session[:user_id].email
    if user_id ==nil || (user_id != nil && user_id.isBlank?)
      user_id = session[:user_id].nickname
    end
    @logical = TaskLogical.new
    @task = @logical.saveTask(params[:task][:content],params[:task][:priority], user_id)
---
INSERT INTO `tasks` (`status`, `updated_at`, `priority`, `content`, `user_id`, `created_at`) VALUES('todo', '2010-05-15 09:30:10', 1, '夕ごはん作成', 'ナカムー', '2010-05-15 09:30:10')

  def add_task_list
    user_id = session[:user_id].email
    if user_id ==nil || (user_id != nil && user_id.isBlank?)
      user_id = session[:user_id].nickname
    end
    @logical = TaskLogical.new
    @task = @logical.saveTask(params[:task][:content],params[:task][:priority], user_id)
---
INSERT INTO `tasks` (`status`, `updated_at`, `priority`, `content`, `user_id`, `created_at`) VALUES('todo', '2010-05-30 06:57:56', 1, 'aaaa', 'ナカムー', '2010-05-30 06:57:56')

  def confirm_recycle
    @logical = TaskLogical.new
    @recycles = @logical.findRecycleTask()
---
SELECT * FROM `tasks` WHERE (status='recycle') ORDER BY priority desc